Merge pull request #24 from kencom2400/feature/MWD-18-task-1-1
feat(design): システム全体アーキテクチャ図をMermaid形式で作成 [MWD-18]
